app/views/questionaries/show.html.erb


    <% @questionary.questionary_item.each do |item| %>
---
SELECT "questionary_items".* FROM "questionary_items" WHERE "questionary_items"."questionary_id" = ?  [["questionary_id", 3]]