app/controllers/questionary_items_controller.rb

SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def new
    @questionary_item = QuestionaryItem.new
       @questionary_item.questionary_id = params[:id]
            @questionary = Questionary.find params[:id]

INSERT INTO "questionary_items" ("content", "questionary_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "働く場所はどう？"], ["questionary_id", 4], ["created_at", "2018-01-31 07:23:54.219167"], ["updated_at", "2018-01-31 07:23:54.219167"]]
---
  def create
    @questionary_item = QuestionaryItem.new(questionary_item_params)

    respond_to do |format|
      if @questionary_item.save