app/controllers/questionary_choices_controller.rb

  def new
    @questionary_choice = QuestionaryChoice.new
    @questionary_choice.questionary_item_id = params[:id]
    @questionary_item = QuestionaryItem.find params[:id]
---
SELECT  "questionary_items".* FROM "questionary_items" WHERE "questionary_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @questionary_choice = QuestionaryChoice.new(questionary_choice_params)

    respond_to do |format|
      if @questionary_choice.save
---
INSERT INTO "questionary_choices" ("content", "value", "questionary_item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "東京都"], ["value", 1], ["questionary_item_id", 1], ["created_at", "2018-01-31 07:30:45.460739"], ["updated_at", "2018-01-31 07:30:45.460739"]]