app/controllers/questionaries_controller.rb

  def index
    @questionaries = Questionary.all.order('created_at desc')
---
SELECT "questionaries".* FROM "questionaries" ORDER BY created_at desc

 def sendform
  id = params[:id]
  result ='question_id:' + id
  for i in 1..10
    str = 'r' + i.to_s
    if params[str] == nil then
      result += ',' + str + ':0'
    else
      result += ',' + str + ':' + params[str]
    end
  end
  obj = QuestionaryResult.new
  obj.questionary_id = id
  obj.result = result
  obj.save!
---
INSERT INTO "questionary_results" ("questionary_id", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def create
    @questionary = Questionary.new(questionary_params)

    respond_to do |format|
      if @questionary.save
---
INSERT INTO "questionaries" ("title", "description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "「眠り」に関するアンケート"], ["description", "皆さん、ぐっすりねむっていますか？"], ["deadline", "2018-01-31 03:23:00"], ["created_at", "2018-01-31 03:27:45.002044"], ["updated_at", "2018-01-31 03:27:45.002044"]]

  def destroy
    @questionary.destroy
---
DELETE FROM "questionaries" WHERE "questionaries"."id" = ?  [["id", 4]]

    def set_questionary
      @questionary = Questionary.find(params[:id])
---
SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]