app/controllers/questionary_results_controller.rb

  def index
    @questionaries = Questionary.all
---
SELECT "questionaries".* FROM "questionaries"

  def show
    @questionary = Questionary.find params[:id]
    @questionary_results = QuestionaryResult.where('questionary_id = ?',params[:id])
---
SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questionary_results".* FROM "questionary_results" WHERE (questionary_id = '        1')

  def create
    @questionary_result = QuestionaryResult.new(questionary_result_params)

    respond_to do |format|
      if @questionary_result.save
---
INSERT INTO "questionary_results" ("questionary_id", "result", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["questionary_id", 1], ["result", "test"], ["created_at", "2018-02-09 02:56:55.307289"], ["updated_at", "2018-02-09 02:56:55.307289"]]

  def calc
    @questionary = Questionary.find params[:id]
    results = QuestionaryResult.where('questionary_id= ?',params[:id])
---
SELECT  "questionaries".* FROM "questionaries" WHERE "questionaries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "questionary_results".* FROM "questionary_results" WHERE (questionary_id= '3')

  def update
    respond_to do |format|
      if @questionary_result.update(questionary_result_params)
---
UPDATE "questionary_results" SET "questionary_id" = ?, "result" = ?, "updated_at" = ? WHERE "questionary_results"."id" = ?  [["questionary_id", 2], ["result", "test1"], ["updated_at", "2018-02-09 13:44:02.877594"], ["id", 2]]

    def set_questionary_result
      @questionary_result = QuestionaryResult.find(params[:id])
---
SELECT  "questionary_results".* FROM "questionary_results" WHERE "questionary_results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]